ART-Badge/SDK/bsp_for_art-badge/libraries/inc/platform/rtl876x.h
/*============================================================================*
 *                               Header Files
*============================================================================*/
#include "core_cm4.h"                       /* Processor and core peripherals */
#include "system_rtl876x.h"


/*============================================================================*
 *                              Types
*============================================================================*/
/** @addtogroup RTL876x_Exported_types RTL876X Exported types
  * @{
  */

typedef enum
{
    RESET = 0,
    SET = !RESET
} FlagStatus, ITStatus;

typedef enum
{
    DISABLE = 0,
    ENABLE = !DISABLE
} FunctionalState;

#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))
//typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group RTL876x_Exported_types */



/*============================================================================*
 *                              RTL876X Pin Number
*============================================================================*/
/** @defgroup RTL876X_Pin_Number RTL876X Pin Number
  * @{
  */
#define P0_0    0   /**<GPIO0   */
#define P0_1    1   /**<GPIO1   */
#define P0_2    2   /**<GPIO2   */
#define P0_3    3   /**<GPIO3   */
#define P0_4    4   /**<GPIO4   */
#define P0_5    5   /**<GPIO5   */
#define P0_6    6   /**<GPIO6   */
#define P0_7    7   /**<GPIO7   */
#define P1_0    8   /**<GPIO8   */
#define P1_1    9   /**<GPIO9   */
#define P1_2    10   /**<GPIO10   */
#define P1_3    11   /**<GPIO11   */
#define P1_4    12   /**<GPIO12   */
#define P1_5    13   /**<GPIO13   */
#define P1_6    14   /**<GPIO14   */
#define P1_7    15   /**<GPIO15   */
#define P2_0    16   /**<GPIO16   */
#define P2_1    17   /**<GPIO17   */
#define P2_2    18   /**<GPIO18   */
#define P2_3    19   /**<GPIO19   */
#define P2_4    20   /**<GPIO20   */
#define P2_5    21   /**<GPIO21   */
#define P2_6    22   /**<GPIO22   */
#define P2_7    23   /**<GPIO23   */
#define P3_0    24   /**<GPIO24   */
#define P3_1    25   /**<GPIO25   */
#define P3_2    26   /**<GPIO26   */
#define P3_3    27   /**<GPIO27   */
#define P3_4    28   /**<GPIO28   */
#define P3_5    29   /**<GPIO29   */
#define P3_6    30   /**<GPIO30   */
#define P4_0    32   /**<GPIO28   */
#define P4_1    33   /**<GPIO29   */
#define P4_2    34   /**<GPIO30   */
#define P4_3    35   /**<GPIO31   */
#define H_0     36   /**<GPIO25   MICBIAS   */
#define H_1     37   /**<GPIO26   32K_XI   */
#define H_2     38   /**<GPIO27   32K_XO   */
/** @} */ /* End of group RTL876X_Pin_Number */


/* ================================================================================ */
/* ================    Peripheral Registers Structures Section     ================ */
/* ================================================================================ */

/** @defgroup RTL876X_Peripheral_Registers_Structures RTL876X Register Structure
  * @{
  */

/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */

/**
  * @brief Universal Asynchronous Receiver/Transmitter, version 1.0. (UART)
  */

typedef struct                                      /*!< UART Structure */
{
    __IO  uint32_t DLL;
    __IO  uint32_t DLH_INTCR;
    __IO  uint32_t INTID_FCR;
    __IO  uint32_t LCR;
    __IO  uint32_t MCR;             /*!<0x10 */
    __I   uint32_t LSR;
    __I   uint32_t MSR;
    __IO  uint32_t SPR;
    __IO  uint32_t STSR;            /*!<0x20 */
    __IO  uint32_t RB_THR;
    __IO  uint32_t MISCR;           /*!<may not be seen for client */
    __IO  uint32_t TXPLSR;
    __IO  uint32_t RSVD0;           /*!<0x30 */
    __IO  uint32_t RSVD1;           /*!<0x34 */
    __IO  uint32_t RSVD2;           /*!<0x38 */
    __IO  uint32_t DBG_UART;        /*!<0x3C */
    __IO  uint32_t RX_IDLE_TOCR;    /*!<0x40 */
    __IO  uint32_t RX_IDLE_INTSR;
    __IO  uint32_t RX_IDLE_INTCR;
    __I   uint32_t FIFO_LEVEL;
    __IO  uint32_t INTMASK;         /*!<0x50 */
    __I   uint32_t TX_DONE_INTSR;
    __I   uint32_t TX_THR_INTSR;
} UART_TypeDef;

typedef enum
{
    LOG_CHANNEL_UART0,
    LOG_CHANNEL_UART1,
    LOG_CHANNEL_UART2
} LogChannel_TypeDef;

/* ================================================================================ */
/* ================                 2WIRE_SPI                      ================ */
/* ================================================================================ */

/**
  * @brief 2wire spi, mostly used with mouse sensor. (2WIRE_SPI)
  */

typedef struct                                      /*!< 3WIRE_SPI Structure */
{
    __IO  uint32_t RSVD0[12];       /*!< 0x00 -- 0x2C for Q-decode */
    __IO  uint32_t CFGR;            /*!< 0x30 */
    __IO  uint32_t CR;
    __IO  uint32_t INTCR;
    __I   uint32_t SR;
    __IO  uint32_t RD0;             /*!< 0x40 */
    __IO  uint32_t RD1;
    __IO  uint32_t RD2;
    __IO  uint32_t RD3;
} SPI3WIRE_TypeDef;

/* ================================================================================ */
/* ================                 IR                             ================ */
/* ================================================================================ */

/**
  * @brief IR.
  */

typedef struct
{
    __IO  uint32_t CLK_DIV;         /*!< 0x00 */
    __IO  uint32_t TX_CONFIG;       /*!< 0x04 */
    __IO  uint32_t TX_SR;           /*!< 0x08 */
    __IO  uint32_t RSVD0;           /*!< 0x0c */
    __IO  uint32_t TX_INT_CLR;      /*!< 0x10 */
    __IO  uint32_t TX_FIFO;         /*!< 0x14 */
    __IO  uint32_t RX_CONFIG;       /*!< 0x18 */
    __IO  uint32_t RX_SR;           /*!< 0x1c */
    __IO  uint32_t RX_INT_CLR;      /*!< 0x20 */
    __IO  uint32_t RX_CNT_INT_SEL;  /*!< 0x24 */
    __IO  uint32_t RX_FIFO;         /*!< 0x28 */
    __IO  uint32_t IR_VERSION;      /*!< 0x2c */
    __IO  uint32_t RSVD1[8];
    __IO  uint32_t DMA_CONFIG;      /*!< 0x50 */
} IR_TypeDef;

/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */

/**
  * @brief SPI master 0. (SPI)
  */
typedef struct                                          /*!< SPI Structure  */
{
    __IO  uint32_t    CTRLR0;                              /*!< 0x00 */
    __IO  uint32_t    CTRLR1;                              /*!< 0x04 */
    __IO  uint32_t    SSIENR;                              /*!< 0x08 */
    __IO  uint32_t    RSVD_0C;                             /*!< 0x0C */
    __IO  uint32_t    SER;                                 /*!< 0x10 */
    __IO  uint32_t    BAUDR;                               /*!< 0x14 */
    __IO  uint32_t    TXFTLR;                              /*!< 0x18 */
    __IO  uint32_t    RXFTLR;                              /*!< 0x1C */
    __I  uint32_t    TXFLR;                                /*!< 0x20 */
    __I  uint32_t    RXFLR;                                /*!< 0x24 */
    __I  uint32_t    SR;                                   /*!< 0x28 */
    __IO  uint32_t    IMR;                                 /*!< 0x2C */
    __I  uint32_t    ISR;                                  /*!< 0x30 */
    __I  uint32_t    RISR;                                 /*!< 0x34 */
    __I  uint32_t    TXOICR;                               /*!< 0x38 */
    __I  uint32_t    RXOICR;                               /*!< 0x3C */
    __I  uint32_t    RXUICR;                               /*!< 0x40 */
    __I  uint32_t    FAEICR;/*RSVD_44;*/                   /*!< 0x44 */
    __I  uint32_t    ICR;                                  /*!< 0x48 */
    __IO  uint32_t    DMACR;                               /*!< 0x4C */
    __IO  uint32_t    DMATDLR;                             /*!< 0x50 */
    __IO  uint32_t    DMARDLR;                             /*!< 0x54 */
    __I  uint32_t    TXUICR;/*IDR;*/                       /*!< 0x58 */
    __I  uint32_t    SSRICR;                               /*!< 0x5C */
    __IO  uint32_t    DR[36];                              /*!< 0x60 - 0xEC */
    __IO  uint32_t    RX_SAMPLE_DLY;                       /*!< 0xF0 */
} SPI_TypeDef;

/* ================================================================================ */
/* ================                      I2C                      ================= */
/* ================================================================================ */

/**
  * @brief I2C
  */
typedef struct
{
    __IO uint32_t IC_CON;
    __IO uint32_t IC_TAR;
    __IO uint32_t IC_SAR;
    __IO uint32_t IC_HS_MADDR;
    __IO uint32_t IC_DATA_CMD;
    __IO uint32_t IC_SS_SCL_HCNT;
    __IO uint32_t IC_SS_SCL_LCNT;
    __IO uint32_t IC_FS_SCL_HCNT;
    __IO uint32_t IC_FS_SCL_LCNT;
    __IO uint32_t IC_HS_SCL_HCNT;
    __IO uint32_t IC_HS_SCL_LCNT;
    __I uint32_t IC_INTR_STAT;
    __IO uint32_t IC_INTR_MASK;
    __I uint32_t IC_RAW_INTR_STAT;
    __IO uint32_t IC_RX_TL;
    __IO uint32_t IC_TX_TL;
    __I uint32_t IC_CLR_INTR;
    __I uint32_t IC_CLR_RX_UNDER;
    __I uint32_t IC_CLR_RX_OVER;
    __I uint32_t IC_CLR_TX_OVER;
    __I uint32_t IC_CLR_RD_REQ;
    __I uint32_t IC_CLR_TX_ABRT;
    __I uint32_t IC_CLR_RX_DONE;
    __I uint32_t IC_CLR_ACTIVITY;
    __I uint32_t IC_CLR_STOP_DET;
    __I uint32_t IC_CLR_START_DET;
    __I uint32_t IC_CLR_GEN_CALL;
    __IO uint32_t IC_ENABLE;
    __I uint32_t IC_STATUS;
    __I uint32_t IC_TXFLR;
    __I uint32_t IC_RXFLR;
    __IO uint32_t IC_SDA_HOLD;
    __I uint32_t IC_TX_ABRT_SOURCE;
    __IO uint32_t IC_SLV_DATA_NACK_ONLY;
    __IO uint32_t IC_DMA_CR;
    __IO uint32_t IC_DMA_TDLR;
    __IO uint32_t IC_DMA_RDLR;
    __IO uint32_t IC_SDA_SETUP;
    __IO uint32_t IC_ACK_GENERAL_CALL;
    __IO uint32_t IC_ENABLE_STATUS;
} I2C_TypeDef;

/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */

/**
  * @brief Analog to digital converter. (ADC)
  */

typedef struct                                      /*!< ADC Structure */
{
    __O  uint32_t FIFO;        //!<0x00
    __IO uint32_t CR;          //!<0x04
    __IO uint32_t SCHCR;       //!<0x08
    __IO uint32_t INTCR;       //!<0x0C
    __IO uint32_t SCHTAB0;     //!<0x10
    __IO uint32_t SCHTAB1;     //!<0x14
    __IO uint32_t SCHTAB2;     //!<0x18
    __IO uint32_t SCHTAB3;     //!<0x1C
    __IO uint32_t SCHTAB4;     //!<0x20
    __IO uint32_t SCHTAB5;     //!<0x24
    __IO uint32_t SCHTAB6;     //!<0x28
    __IO uint32_t SCHTAB7;     //!<0x2C
    __IO uint32_t SCHD0;       //!<0x30
    __IO uint32_t SCHD1;       //!<0x34
    __IO uint32_t SCHD2;       //!<0x38
    __IO uint32_t SCHD3;       //!<0x3C
    __IO uint32_t SCHD4;       //!<0x40
    __IO uint32_t SCHD5;       //!<0x44
    __IO uint32_t SCHD6;       //!<0x48
    __IO uint32_t SCHD7;       //!<0x4C
    __IO uint32_t PWRDLY;      //!<0x50
    __IO uint32_t DATCLK;      //!<0x54
    __IO uint32_t ANACTL;      //!<0x58

} ADC_TypeDef;

