ART-Badge/SDK/bsp_for_art-badge/libraries/inc/platform/rtl876x.h
/* =============================================================================== */
/* ================                      TIM                      ================ */
/* =============================================================================== */

/**
  * @brief TIM
  */
typedef struct
{
    __IO uint32_t LoadCount;        /*!< 0x00*/
    __I  uint32_t CurrentValue;     /*!< 0x04*/
    __IO uint32_t ControlReg;       /*!< 0x08*/
    __I  uint32_t EOI;              /*!< 0x0C*/
    __I  uint32_t IntStatus;        /*!< 0x10*/
} TIM_TypeDef;

/* ============================================================================== */
/* ================                      PWM                     ================ */
/* ============================================================================== */

/**
  * @brief PWM
  */
typedef struct
{
    __IO uint32_t CR;               /*!< 0x00 */
} PWM_TypeDef;

/* ================================================================================ */
/* ================                      GDMA                      ================ */
/* ================================================================================ */
/**
  * @brief GDMA
  */
typedef struct
{
    __I uint32_t RAW_TFR;
    uint32_t RSVD0;
    __I uint32_t RAW_BLOCK;
    uint32_t RSVD1;
    __I uint32_t RAW_SRC_TRAN;
    uint32_t RSVD2;
    __I uint32_t RAW_DST_TRAN;
    uint32_t RSVD3;
    __I uint32_t RAW_ERR;
    uint32_t RSVD4;

    __I uint32_t STATUS_TFR;
    uint32_t RSVD5;
    __I uint32_t STATUS_BLOCK;
    uint32_t RSVD6;
    __I uint32_t STATUS_SRC_TRAN;
    uint32_t RSVD7;
    __I uint32_t STATUS_DST_TRAN;
    uint32_t RSVD8;
    __I uint32_t STATUS_ERR;
    uint32_t RSVD9;

    __IO uint32_t MASK_TFR;
    uint32_t RSVD10;
    __IO uint32_t MASK_BLOCK;
    uint32_t RSVD11;
    __IO uint32_t MASK_SRC_TRAN;
    uint32_t RSVD12;
    __IO uint32_t MASK_DST_TRAN;
    uint32_t RSVD13;
    __IO uint32_t MASK_ERR;
    uint32_t RSVD14;

    __O uint32_t CLEAR_TFR;
    uint32_t RSVD15;
    __O uint32_t CLEAR_BLOCK;
    uint32_t RSVD16;
    __O uint32_t CLEAR_SRC_TRAN;
    uint32_t RSVD17;
    __O uint32_t CLEAR_DST_TRAN;
    uint32_t RSVD18;
    __O uint32_t CLEAR_ERR;
    uint32_t RSVD19;
    __O uint32_t StatusInt;
    uint32_t RSVD191;

    __IO uint32_t ReqSrcReg;
    uint32_t RSVD20;
    __IO uint32_t ReqDstReg;
    uint32_t RSVD21;
    __IO uint32_t SglReqSrcReg;
    uint32_t RSVD22;
    __IO uint32_t SglReqDstReg;
    uint32_t RSVD23;
    __IO uint32_t LstSrcReg;
    uint32_t RSVD24;
    __IO uint32_t LstDstReg;
    uint32_t RSVD25;

    __IO uint32_t DmaCfgReg;
    uint32_t RSVD26;
    __IO uint32_t ChEnReg;
    uint32_t RSVD27;
    __I uint32_t DmaIdReg;
    uint32_t RSVD28;
    __IO uint32_t DmaTestReg;
    uint32_t RSVD29;
} GDMA_TypeDef;

typedef struct
{
    __IO uint32_t SAR;
    uint32_t RSVD0;
    __IO uint32_t DAR;
    uint32_t RSVD1;
    __IO uint32_t LLP;
    uint32_t RSVD2;
    __IO uint32_t CTL_LOW;
    __IO uint32_t CTL_HIGH;
    __IO uint32_t SSTAT;
    uint32_t RSVD4;
    __IO uint32_t DSTAT;
    uint32_t RSVD5;
    __IO uint32_t SSTATAR;
    uint32_t RSVD6;
    __IO uint32_t DSTATAR;
    uint32_t RSVD7;
    __IO uint32_t CFG_LOW;
    __IO uint32_t CFG_HIGH;
    __IO uint32_t SGR;
    uint32_t RSVD9;
    __IO uint32_t DSR;
    uint32_t RSVD10;
} GDMA_ChannelTypeDef;

/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */

/**
  * @brief Real time counter 0. (RTC)
  */

typedef struct                                      /*!< RTC Structure                                                         */
{
    __IO uint32_t CR0;              /*!< 0x00 */
    __IO uint32_t INT_CLR;          /*!< 0x04 */
    __IO uint32_t INT_SR;           /*!< 0x08 */
    __IO uint32_t PRESCALER;        /*!< 0x0C */
    __IO uint32_t COMP0;            /*!< 0x10 */
    __IO uint32_t COMP1;            /*!< 0x14 */
    __IO uint32_t COMP2;            /*!< 0x18 */
    __IO uint32_t COMP3;            /*!< 0x1C */
    __I  uint32_t CNT;              /*!< 0x20 */
    __IO uint32_t PRE_CNT;          /*!< 0x24 */
    __IO uint32_t PRE_COMP;         /*!< 0x28 */
} RTC_TypeDef;
/**
  * @brief Real time for lp (RTC)
  */
typedef struct
{
    __IO uint32_t LPC_CR0;
    __IO uint32_t LPC_SR;
    __IO uint32_t LPC_CMP;
    __IO uint32_t LPC_CNT;
} LPC_TypeDef;

///**
//  * @brief SLEEP MODE LED (RTC)
//  */

//typedef struct
//{
//    __IO uint32_t S_LED_CR;         //!<0x00
//    __IO uint32_t S_LED_CH0_CR0;    //!<0x04
//    __IO uint32_t S_LED_CH0_CR1;    //!<0x08
//    __IO uint32_t S_LED_CH0_P1_CR;  //!<0x0C
//    __IO uint32_t S_LED_CH0_P2_CR;  //!<0x10
//    __IO uint32_t S_LED_CH0_P3_CR;  //!<0x14
//    __IO uint32_t S_LED_CH0_P4_CR;  //!<0x18
//    __IO uint32_t S_LED_CH0_P5_CR;  //!<0x1C
//    __IO uint32_t S_LED_CH0_P6_CR;  //!<0x20
//    __IO uint32_t S_LED_CH0_P7_CR;  //!<0x24
//    __IO uint32_t S_LED_CH0_P8_CR;  //!<0x28

//    __IO uint32_t RSV0;             //!<0x2C

//    __IO uint32_t S_LED_CH1_CR0;    //!<0x30
//    __IO uint32_t S_LED_CH1_CR1;    //!<0x34
//    __IO uint32_t S_LED_CH1_P1_CR;  //!<0x38
//    __IO uint32_t S_LED_CH1_P2_CR;  //!<0x3C
//    __IO uint32_t S_LED_CH1_P3_CR;  //!<0x40
//    __IO uint32_t S_LED_CH1_P4_CR;  //!<0x44
//    __IO uint32_t S_LED_CH1_P5_CR;  //!<0x48
//    __IO uint32_t S_LED_CH1_P6_CR;  //!<0x4C
//    __IO uint32_t S_LED_CH1_P7_CR;  //!<0x50
//    __IO uint32_t S_LED_CH1_P8_CR;  //!<0x54

//    __IO uint32_t RSV1;             //!<0x58
//    __IO uint32_t RSV2;             //!<0x5C

//    __IO uint32_t S_LED_CH2_CR0;    //!<0x60
//    __IO uint32_t S_LED_CH2_CR1;    //!<0x64
//    __IO uint32_t S_LED_CH2_P1_CR;  //!<0x68
//    __IO uint32_t S_LED_CH2_P2_CR;  //!<0x6C
//    __IO uint32_t S_LED_CH2_P3_CR;  //!<0x70
//    __IO uint32_t S_LED_CH2_P4_CR;  //!<0x74
//    __IO uint32_t S_LED_CH2_P5_CR;  //!<0x78
//    __IO uint32_t S_LED_CH2_P6_CR;  //!<0x7C
//    __IO uint32_t S_LED_CH2_P7_CR;  //!<0x80
//    __IO uint32_t S_LED_CH2_P8_CR;  //!<0x84
//} RTC_LED_TypeDef;

/* ================================================================================ */
/* ================                      QDEC                      ================ */
/* ================================================================================ */

/**
  * @brief Rotary decoder. (QDEC)
  */

typedef struct                                      /*!< QDEC Structure           */
{
    __IO uint32_t   REG_DIV;        /*!< 0x00 */
    __IO uint32_t   REG_CR_X;       /*!< 0x04 */
    __IO uint32_t   REG_SR_X;       /*!< 0x08 */
    __IO uint32_t   REG_CR_Y;       /*!< 0x0C */
    __IO uint32_t   REG_SR_Y;       /*!< 0x10 */
    __IO uint32_t   REG_CR_Z;       /*!< 0x14 */
    __IO uint32_t   REG_SR_Z;       /*!< 0x18 */
    __IO uint32_t   INT_MASK;       /*!< 0x1C */
    __IO uint32_t   INT_SR;         /*!< 0x20 */
    __IO uint32_t   INT_CLR;        /*!< 0x24 */
    __IO uint32_t   REG_DBG;        /*!< 0x28 */
    __IO uint32_t   REG_VERSION;    /*!< 0x2C  */
} QDEC_TypeDef;

/* ================================================================================ */
/* ================                     Watch Dog                  ================ */
/* ================================================================================ */

/**
  * @brief Watch Dog. (WDG)
  */

typedef struct                                   /*!< WDG Structure           */
{
    __IO uint32_t WDG_CTL;          /*!< 0x00 */
} WDG_TypeDef;

/**
  * @brief AON Watchdog
  */
typedef struct
{
    union
    {
        __IO uint32_t CRT; /*!< 0x00 (R/W) Control Register                                       */
        struct
        {
            uint32_t EN: 2;     /*!< R/W WDT2 Enable, 2'b10: OFF, the other value: ON             */
            uint32_t CNT_CTL: 1; /*!< R/W Counter Control,
                                     1: WDG continue count in DLPS/Power Down/Hibernate,
                                     0: WDG stop count in DLPS/Power Down/Hibernate               */
            uint32_t RST_LVL: 1; /*!< R/W Reset Level,
                                   1: Level 2 reset (reset whole chip),
                                   0: Level 1 reset (reset whole chip except partial AON and RTC) */
            uint32_t CNT_RELOAD: 1; /*!< R/W Reload Counter,
                                        1: Reload counter when exit DLPS/Power Down/Hibernate,
                                        0: Not reload counter when exit DLPS/Power Down/Hibernate */
            uint32_t RSVD0: 3;
            uint32_t COMP: 18;  /*!< R/W Set the period of AON WDG : 1/450Hz ~ 1/2.3KHz           */
            uint32_t RSVD1: 6;
        } CRT_BITS;
    } u;
    __IO uint32_t CNT_CLR; /*!< 0x04 (R/W) Clear Register, write 1 to reload AON WDG counter      */
    __IO uint32_t WP;      /*!< 0x08 (R/W) Write Protect Register, write 1 to enable write CRT    */
} AON_WDG_TypeDef;

/* ================================================================================ */
/* ================                     random generator           ================ */
/* ================================================================================ */

/**
  * @brief random generator. (RAN_GEN)
  */

typedef struct                                      /*!< RAN_GEN Structure */
{
    union
    {
        __IO uint32_t CTL;                                        /*!< 0x00              */
        struct
        {
            __IO uint32_t rand_gen_en: 1;
            __IO uint32_t seed_upd: 1;
            __IO uint32_t random_req: 1;
            __IO uint32_t opt_rand_upd: 1;
            __IO uint32_t soft_rst: 1;
            __IO uint32_t rsvd: 27;
        } CTL_BITS;
    } u;
    __IO uint32_t POLYNOMIAL;                                     /*!< 0x04              */
    __IO uint32_t SEED;                                           /*!< 0x08              */
    __IO uint32_t RAN_NUM;                                        /*!< 0x0C              */
} RAN_GEN_TypeDef;

/* ================================================================================ */
/* ================            System Block Control            ================ */
/* ================================================================================ */

/**
  * @brief System Block Control. (SYS_BLKCTRL)
  */

typedef struct                                          /*!< SYS_BLKCTRL Structure      */
{
    union
    {
        __IO uint32_t        SYS_CLK_SEL;                      /*!< 0x200  */
        struct
        {
            __IO uint32_t r_cpu_slow_en: 1;
            __IO uint32_t r_cpu_slow_opt_wfi: 1;
            __IO uint32_t r_cpu_slow_opt_at_tx: 1;
            __IO uint32_t r_cpu_slow_opt_at_rx: 1;
            __IO uint32_t rsvd0: 2;
            __IO uint32_t r_zone1_wrp_en: 1;
            __IO uint32_t r_zone2_wrp_en: 1;
            __IO uint32_t r_wrp_en_lock: 1;
            __IO uint32_t rsvd1: 10;
            __IO uint32_t r_bt_ahb_wait_cnt: 6;
            __IO uint32_t rsvd2: 3;
            __IO uint32_t r_aon_rd_opt: 1;
            __IO uint32_t r_btaon_acc_no_block: 1;
            __IO uint32_t bzdma_autoslow_eco_disable: 1;
            __IO uint32_t rsvd3: 1;
        } BITS_200;
    } u_200;
    __IO uint32_t    RSVD_204;                             /*!< 0x204     */
    union
    {
        __IO uint32_t        CTRL_208;                         /*!< 0x208  */
        struct
        {
            __IO uint32_t r_cpu_div_sel: 4;
            __IO uint32_t r_cpu_div_sel_slow: 4;
            __IO uint32_t r_cpu_div_en: 1;
            __IO uint32_t r_CPU_CLK_SRC_EN: 1;
            __IO uint32_t r_dsp_auto_slow_filter_en: 1;
            __IO uint32_t r_cpu_clk_mux_0_cg_en: 1;
            __IO uint32_t r_cpu_pll_clk_cg_en: 1; //12
            __IO uint32_t r_cpu_xtal_clk_cg_en: 1;
            __IO uint32_t r_cpu_osc40_clk_cg_en: 1;
            __IO uint32_t r_cpu_div_en_slow: 1;
            __IO uint32_t r_disable_pll_clk: 1; //16 W1O
            __IO uint32_t r_lock_cpu_divider: 1;//17 W1O
            __IO uint32_t r_dw_spi0_clock: 1;   //18 W1O
            __IO uint32_t r_dw_spi1_clock: 1;   //19 W1O
            __IO uint32_t rsvd1: 1; //20
            __IO uint32_t r_disable_dataram0: 1;//21 W1O
            __IO uint32_t r_disable_dataram1: 1;//22 W1O
            __IO uint32_t rsvd2: 2; //23 - 24
            __IO uint32_t r_disable_spic1: 1; //25
            __IO uint32_t r_disable_spic2: 1; //26
            __IO uint32_t rsvd3: 5; //27 - 31
        } BITS_208;
    } u_208;
    union
    {
        __IO uint32_t        RSVD_20C;                         /*!< 0x20C */
        struct
        {
            __IO uint32_t r_flash_div_sel: 4;
            __IO uint32_t r_flash_div_en: 1;
            __IO uint32_t r_FLASH_CLK_SRC_EN: 1;
            __IO uint32_t r_flash_clk_src_sel_1: 1;
            __IO uint32_t r_flash_clk_src_sel_0: 1;
            __IO uint32_t r_flash_mux_1_clk_cg_en: 1;
            __IO uint32_t r_rng_sfosc_sel: 1;
            __IO uint32_t rsvd1: 12;
            __IO uint32_t r_CLK_40M_SRC_EN: 1;
            __IO uint32_t rsvd2: 1;
            __IO uint32_t r_40m_clk_src_sel_0: 1;
            __IO uint32_t rsvd3: 1;
            __IO uint32_t r_CLK_40M_SRC_DIV_EN: 1;
            __IO uint32_t r_CLK_20M_SRC_EN: 1;
            __IO uint32_t r_CLK_10M_SRC_EN: 1;
            __IO uint32_t r_CLK_5M_SRC_EN: 1;
            __IO uint32_t rsvd4: 2;
        } BITS_20C;
    } u_20C;
    union
    {
        __IO uint32_t        SOC_FUNC_EN;                      /*!< 0x210 */
        struct
        {
            __IO uint32_t rsvd0: 2;
            __IO uint32_t BIT_SOC_BTBUS_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_EN1: 1;
            __IO uint32_t BIT_SOC_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_EN2: 1;
            __IO uint32_t rsvd2: 6;
            __IO uint32_t BIT_SOC_LOG_UART_EN: 1;
            __IO uint32_t BIT_SOC_GDMA0_EN: 1;
            __IO uint32_t rsvd3: 2;
            __IO uint32_t BIT_SOC_GTIMER_EN: 1;
            __IO uint32_t rsvd4: 15;
        } BITS_210;
    } u_210;
    __IO uint32_t    RSVD1;                                /*!< 0x214     */
    union
    {
        __IO uint32_t        PERI_FUNC0_EN;                    /*!< 0x218    */
        struct
        {
            __IO uint32_t BIT_PERI_UART0_EN: 1;
            __IO uint32_t BIT_PERI_LOGUART1_EN: 1;
            __IO uint32_t BIT_PERI_AES_EN: 1;
            __IO uint32_t BIT_PERI_RNG_EN: 1;
            __IO uint32_t rsvd0: 4;
            __IO uint32_t BIT_PERI_SPI0_EN: 1;
            __IO uint32_t BIT_PERI_SPI1_EN: 1;
            __IO uint32_t BIT_PERI_IR_EN: 1;
            __IO uint32_t rsvd1: 5;
            __IO uint32_t BIT_PERI_I2C0_EN: 1;
            __IO uint32_t BIT_PERI_I2C1_EN: 1;
            __IO uint32_t BIT_PERI_QDECODE_EN: 1;
            __IO uint32_t BIT_PERI_KEYSCAN_EN: 1;
            __IO uint32_t rsvd2: 4;
            __IO uint32_t BIT_PERI_SPI2W_EN: 1;
            __IO uint32_t BIT_LCD_EN: 1;
            __IO uint32_t rsvd3: 4;
            __IO uint32_t BIT_EFUSE_EN: 1;
            __IO uint32_t rsvd4: 1;
        } BITS_218;
    } u_218;
    union
    {
        __IO uint32_t        PERI_FUNC1_EN;                    /*!< 0x21C      */
        struct
        {
            __IO uint32_t BIT_PERI_ADC_EN: 1;
            __IO uint32_t rsvd0: 7;
            __IO uint32_t BIT_PERI_GPIO_EN: 1;
            __IO uint32_t rsvd1: 23;
        } BITS_21C;
    } u_21C;
    __IO uint32_t    u_220;                                 /*!< 0x220  */
    __IO uint32_t    RSVD2[3];                             /*!< 0x224~0x22C   */
    union
    {
        __IO uint32_t        CLK_CTRL;                         /*!< 0x230  */
        struct
        {
            __IO uint32_t BIT_CKE_HWSPI: 1;
            __IO uint32_t BIT_CKE_CORDIC: 1;
            __IO uint32_t BIT_SOC_CKE_PLFM: 1;
            __IO uint32_t BIT_CKE_EFC: 1;
            __IO uint32_t BIT_CKE_BUS_RAM_SLP: 1;
            __IO uint32_t BIT_CKE_BT_VEN: 1;
            __IO uint32_t BIT_SOC_ACTCK_VENDOR_REG_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_VENDOR_REG_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_LOG_UART1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_LOG_UART1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_LOG_UART_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_LOG_UART_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_TIMER_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_TIMER_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_GDMA0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_GDMA0_EN: 1;
            __IO uint32_t rsvd0: 6;
            __IO uint32_t BIT_SOC_ACTCK_GPIO_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_GPIO_EN: 1;
            __IO uint32_t rsvd1: 6;
        } BITS_230;
    } u_230;
    union
    {
        __IO uint32_t        PERI_CLK_CTRL0;                   /*!< 0x234     */
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_UART0_DATA_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART0_DATA_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART1_HCI_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART1_HCI_EN: 1;
            __IO uint32_t BIT_CKE_MODEM: 1;
            __IO uint32_t BIT_CKE_CAL32K: 1;
            __IO uint32_t BIT_CKE_RNG: 1;
            __IO uint32_t rsvd0: 9;
            __IO uint32_t BIT_SOC_ACTCK_SPI0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_SPI1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_IR_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_IR_EN: 1;
            __IO uint32_t rsvd1: 2;
            __IO uint32_t BIT_SOC_ACTCK_FLASH1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH2_EN: 1;
            __IO uint32_t rsvd2: 4;
        } BITS_234;
    } u_234;
    union
    {
        __IO uint32_t        PERI_CLK_CTRL1;                   /*!< 0x238    */
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_I2C0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_I2C0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_I2C1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_I2C1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_QDECODE_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_QDECODE_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_KEYSCAN_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_KEYSCAN_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_AES_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_AES_EN: 1;
            __IO uint32_t rsvd0: 6;
            __IO uint32_t BIT_SOC_ACTCK_SPI_3WIRE_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI_3WIRE_EN: 1;
            __IO uint32_t rsvd1: 6;
            __IO uint32_t BIT_SOC_ACTCK_ADC_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_ADC_EN: 1;
            __IO uint32_t rsvd2: 2;
            __IO uint32_t BIT_SOC_ACTCKE_LCD: 1;
            __IO uint32_t BIT_SOC_SLPCKE_LCD: 1;
            __IO uint32_t rsvd3: 1;
            __IO uint32_t BIT_SOC_CLK_EFUSE: 1;
        } BITS_238;
    } u_238;
    __IO uint32_t    RSVD3[2];                             /*!< 0x23C~0x240  */
    union
    {
        __IO uint32_t        COM_CLK_CTRL1;                    /*!< 0x244    */
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_BTBUS_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_BTBUS_EN: 1;
            __IO uint32_t rsvd0: 20;
            __IO uint32_t r_LS_mcu_rom: 1;
            __IO uint32_t rsvd1: 9;
        } BITS_244;
    } u_244;
    __IO uint32_t    RSVD4[24];                            /*!< 0x248~0x2A4     */
    union
    {
        __IO uint32_t REG_2A8;
        __IO uint32_t        REG_TEST_MODE;                    /*!< 0x2A8  */
        struct
        {
            __IO uint32_t PMUX_TEST_MODE: 4;
            __IO uint32_t rsvd: 3;
            __IO uint32_t PMUX_TEST_MODE_EN: 1;
            __IO uint32_t SPIC1_MASTER_EN: 1;
            __IO uint32_t SPIC2_MASTER_EN: 1;
            __IO uint32_t rsvd0: 6;
            __IO uint32_t PMUX_DBG_MODE_SEL: 4;
            __IO uint32_t rsvd1: 1;
            __IO uint32_t PMUX_LCD_RD_DIS: 1;
            __IO uint32_t PMUX_LCD_VSYNC_DIS: 1;
            __IO uint32_t PMUX_DIG_SMUX_EN: 1;
            __IO uint32_t SPIC_MASTER_EN: 1;
            __IO uint32_t PMUX_SPIM_EN_OPT: 1;
            __IO uint32_t PMUX_FLASH_EXTC_EN: 1;
            __IO uint32_t PMUX_FLASH_EN: 1;
            __IO uint32_t PMUX_HCI_UART_DISABLE: 1;
            __IO uint32_t rsvd2: 3;
        } BITS_2A8;
    } u_2A8;
    __IO uint32_t    RSVD5[29];                            /*!< 0x2AC~0x31C   */
    union
    {
        __IO uint32_t BT_ANAPAR_PLL;                           /*!< 0x320  */
        struct
        {
            //PLL0
            __IO uint32_t reg_fref_edge: 1; //0
            __IO uint32_t reg_dogenb:   1; //1
            __IO uint32_t reg_cp_bia:   3; //2:4
            __IO uint32_t reg_vc_THL:   2; //5:6
            __IO uint32_t reg_rs_set:   3; //7:9
            __IO uint32_t reg_cs_set:   2; //10:11
            __IO uint32_t reg_cp_set:   2; //12:13
            __IO uint32_t pow_od:       1; //14
            __IO uint32_t reg_pll:      1; //15
            //PLL1
            __IO uint32_t reg_r3_set:   3; //16:18
            __IO uint32_t reg_c3_set:   2; //19:20
            __IO uint32_t reg_div:      6; //21:26
            __IO uint32_t reg_CKO_en:   1; //27
            __IO uint32_t dummy:        4; //28:31
        } BITS_320;
    } u_320;
    __IO uint32_t    RSVD6[2];                             /*!< 0x324~0x328   */
    union
    {
        __IO uint32_t        RG0X_40M;                         /*!< 0x32C  */
        struct
        {
            __IO uint32_t FSET_OSC40: 4;
            __IO uint32_t rsvd0: 28;
        } BITS_32C;
    } u_32C;
    union
    {
        __IO uint32_t        PERI_ON_330;                      /*!< 0x330 */
        struct
        {
            __IO uint32_t rst_n_aac: 1;
            __IO uint32_t Offset_plus: 1;
            __IO uint32_t XAAC_GM_offset: 6;
            __IO uint32_t GM_STEP: 1;
            __IO uint32_t GM_INIT: 6;
            __IO uint32_t XTAL_CLK_SET: 3;
            __IO uint32_t GM_STUP: 6;
            __IO uint32_t GM_MANUAL: 6;
            __IO uint32_t r_EN_XTAL_AAC_DIGI: 1;
            __IO uint32_t r_EN_XTAL_AAC_TRIG: 1;
        } BITS_330;
    } u_330;
    union
    {
        __IO uint32_t        PERI_ON_334;                      /*!< 0x334  */
        struct
        {
            __IO uint32_t XAAC_BUSY: 1;
            __IO uint32_t XAAC_READY: 1;
            __IO uint32_t XTAL_GM_OUT: 6;
            __IO uint32_t xaac_curr_state: 4;
            __IO uint32_t EN_XTAL_AAC_GM: 1;
            __IO uint32_t EN_XTAL_AAC_PKDET: 1;
            __IO uint32_t rsvd0: 18;
        } BITS_334;
    } u_334;
    union
    {
        __IO uint32_t        PERI_ON_338;                      /*!< 0x338  */
        struct
        {
            __IO uint32_t rsvd0: 24;
            __IO uint32_t BT_PLL_READY: 1;
            __IO uint32_t XTAL_OK: 1;
            __IO uint32_t rsvd1: 6;
        } BITS_338;
    } u_338;
} SYS_BLKCTRL_TypeDef;

/* ================================================================================ */
/* ================                     Pinmux                     ================ */
/* ================================================================================ */

/**
  * @brief Pinmux. (Pinmux)
  */

