ART-Badge/SDK/bsp_for_art-badge/libraries/inc/platform/rtl876x.h
typedef struct                                      /*!< Pinmux Structure */
{
    __IO uint32_t
    CFG[10];                              /*!<                                            */
} PINMUX_TypeDef;

/* ================================================================================ */
/* ================                   Peripheral                   ================ */
/* ================================================================================ */

/**
  * @brief Peripheral. (Peripheral)
  */

typedef struct                                      /*!< Peripheral Structure */
{
    uint32_t RSVD0[134];                                /*!< Reserved */
    __IO uint32_t    PERI_FUNC0_EN;                     /*!< 0x218 */
    __IO uint32_t    PERI_FUNC1_EN;                     /*!< 0x21C */
    __IO uint32_t    PERI_BD_FUNC0_EN;                  /*!< 0x220 */
    uint32_t RSVD1[3];                                  /*!< Reserved */
    __IO uint32_t    PERI_CLK_CTRL;                     /*!< 0x230 */
    __IO uint32_t    PERI_CLK_CTRL0;                    /*!< 0x234 */
    __IO uint32_t    PERI_CLK_CTRL1;                    /*!< 0x238 */
} PHERIPHERIAL_TypeDef;

/* ================================================================================ */
/* ================              Peripheral Interrupt              ================ */
/* ================================================================================ */

/**
  * @brief Peripheral Interrupt. (Peripheral Interrupt)
  */

typedef struct                 /*!< Peripheral Interrupt Structure */
{
    __IO uint32_t RSVD0;       /*!< 0x00 */
    __IO uint32_t STATUS;      /*!< 0x04 */
    __IO uint32_t MODE;        /*!< 0x08, 0: high level active, 1: edge trigger */
    __IO uint32_t EN;          /*!< 0x0C */
    __IO uint32_t RSVD1;       /*!< 0x10 */
    __IO uint32_t RSVD2;       /*!< 0x14 */
    __IO uint32_t EDGE_MODE;   /*!< 0x18, 0: rising edge (HW default), 1: both edge */
} PERI_INT_TypeDef;

/* ================================================================================ */
/* ================                    Security                    ================ */
/* ================================================================================ */

/**
  * @brief Security. (Security)
  */

typedef union                                               /*!< Security Structure */
{
    __IO uint32_t d32;
    struct
    {
        __IO uint32_t reg_pon_debug_port_wp: 1;
        __IO uint32_t reg_pon_debug_port: 1;
        __IO uint32_t reg_pon_hwspi_en_wp: 1;
        __IO uint32_t reg_pon_hwspi_en: 1;
        __IO uint32_t is_efuse_invalid: 1;
        __IO uint32_t reg_efuse_system_general_ctrl_lock: 1;
        __IO uint32_t rsvd0: 2;
        __IO uint32_t is_enable_efuse_read_protect: 1;
        __IO uint32_t is_enable_efuse_write_protect: 1;
        __IO uint32_t is_disable_hci_ram_patch: 1;
        __IO uint32_t is_disable_hci_flash_access: 1;
        __IO uint32_t is_disable_hci_system_access: 1;
        __IO uint32_t is_disable_hci_efuse_access: 1;
        __IO uint32_t is_disable_hci_bt_test: 1;
        __IO uint32_t is_debug_password_invalid: 1;
        __IO uint32_t rsvd1: 4;
        __IO uint32_t reg_pon_clk_flash_dis: 1;
        __IO uint32_t rsvd2: 11;
    };
} SECURITY_TypeDef;

/* ================================================================================ */
/* ================                    Key Scan                    ================ */
/* ================================================================================ */

/**
  * @brief Key Scan. (KeyScan)
  */

typedef struct                                      /*!< KeyScan Structure */
{

    __IO uint32_t CLKDIV;               /*!< 0x00 */
    __IO uint32_t TIMERCR;              /*!< 0x04 */
    __IO uint32_t CR;                   /*!< 0x08 */
    __IO uint32_t COLCR;                /*!< 0x0C */
    __IO uint32_t ROWCR;                /*!< 0x10 */
    __I  uint32_t FIFODATA;             /*!< 0x14 */
    __IO uint32_t INTMASK;              /*!< 0x18 */
    __IO uint32_t INTCLR;               /*!< 0x1C */
    __I  uint32_t STATUS;               /*!< 0x20 */

} KEYSCAN_TypeDef;

/* ======================================================== */
/* ================                      GPIO                       ================ */
/* ======================================================== */

/**
  * @brief General purpose input and output. (GPIO)
  */

typedef struct
{
    __IO uint32_t DATAOUT;                              /*!< Data register: data output */
    __IO uint32_t DATADIR;                              /*!< Data direction register */
    __IO uint32_t DATASRC;                              /*!< Data source register  */
    uint32_t RSVD[9];
    __IO uint32_t INTEN;                                /*!< Interrupt enable register */
    __IO uint32_t INTMASK;                              /*!< Interrupt mask register */
    __IO uint32_t INTTYPE;                              /*!< Interrupt level register */
    __IO uint32_t INTPOLARITY;                          /*!< Interrupt polarity register */
    __IO uint32_t INTSTATUS;                            /*!< Interrupt status of Port A  */
    __IO uint32_t RAWINTSTATUS;           /*!< Raw interrupt status of Port A (premasking) */
    __IO uint32_t DEBOUNCE;                             /*!< Debounce enable register */
    __O  uint32_t INTCLR;                               /*!< clear interrupt register */
    __I  uint32_t DATAIN;                               /*!< external port register */
    uint32_t RSVD1[3];
    __IO uint32_t LSSYNC;                 /*!< Level-sensitive synchronization enable register*/
    __I  uint32_t IDCODE;                               /*!< ID code register */
    __IO uint32_t INTBOTHEDGE;                          /*!< Both edge to trigger interrupt*/
} GPIO_TypeDef;

/* ============================================================================== */
/* ================                 Peri clock reg               ================ */
/* ============================================================================== */

/**
  * @brief PWM
  */
typedef struct
{
    __IO uint32_t CLKSELE;              /*!< 0x348*/
    uint32_t RSVD[4];
    __IO uint32_t CLK_SRCL;
    __IO uint32_t CLK_SRCH;             /*!< 0x360*/
    __IO uint32_t PWM0_CTRL_L;
    __IO uint32_t PWM0_CTRL_H;
    __IO uint32_t PWM1_CTRL_L;
    __IO uint32_t PWM1_CTRL_H;          /*!< 0x370*/
    __IO uint32_t PWM2_CTRL_L;
    __IO uint32_t PWM2_CTRL_H;
    __IO uint32_t PWM3_CTRL_L;
    __IO uint32_t PWM3_CTRL_H;          /*!< 0x380*/
    __IO uint32_t TIM_EVT_CTRL;

} Peri_ClockGate_TypeDef;


/* ======================================================= */
/* ================                      CACHE                     ================ */
/* ======================================================= */

/**
  * @brief cache for flash
  */
typedef struct
{
    __IO uint32_t CACHE_ENABLE;      /*!< SPIC cache Enable Register, Address Offset: 0x00*/
    __IO uint32_t FLUSH;             /*!< Cache Flush register, Address Offset: 0x04*/
    __IO uint32_t INTR;              /*!< Cache Interrupt register, Address Offset: 0x08*/
    __O  uint32_t RST_CNT;           /*!< Cache Reset Counter register, Address Offset: 0x0C*/
    __I  uint32_t RD_EVT_CNT;        /*!< Cache Read Event Counter register, Address Offset: 0x10*/
    __I  uint32_t HIT_EVT_CNT;       /*!< Cache HIT Event Counter register, Address Offset: 0x14*/
    __I  uint32_t HIT_LSTW_EVT_CNT;  /*!< Cache Hit lastway event counter register, Offset: 0x18*/
    __I  uint32_t RD_PND_CNT;        /*!< Cache Read pending counter register, Offset: 0x1c*/
    __I  uint32_t RSVD0[4];          /*!< Reserved, Offset: 0x20 ~ 0x2C */
    __IO uint32_t HITWAYBUF_CTRL;    /*!< Cache Hit way buffer control register, Offset: 0x30 */
    __IO uint32_t CACHE_RAM_CTRL;    /*!< Cache Two way function control register, Offset: 0x34 */
    __IO uint32_t COUNTER_ENABLE;    /*!< Cache counter enable register, Offset: 0x38 */
} CACHE_TypeDef;

/* ================================================================================ */
/* ================                      SPIC                      ================ */
/* ================================================================================ */
typedef struct
{
    __IO uint32_t ctrlr0;           /*!< SPIC control register0,        Address offset: 0x000 */
    __IO uint32_t ctrlr1;           /*!< SPIC control register1,        Address offset: 0x004 */
    __IO uint32_t ssienr;           /*!< SPIC enable register,      Address offset: 0x008 */
    __IO uint32_t mwcr;         /*!< N/A,                   Address offset: 0x00C */
    __IO uint32_t ser;              /*!< SPIC slave enable register,    Address offset: 0x010 */
    __IO uint32_t baudr;            /*!< SPIC baudrate select register, Address offset: 0x014 */
    __IO uint32_t txftlr;       /*!< SPIC transmit FIFO threshold level,    Address offset: 0x018 */
    __IO uint32_t rxftlr;       /*!< SPIC receive FIFO threshold level, Address offset: 0x01C */
    __IO uint32_t txflr;            /*!< SPIC transmit FIFO level register, Address offset: 0x020 */
    __IO uint32_t rxflr;            /*!< SPIC receive FIFO level register,  Address offset: 0x024 */
    __IO uint32_t sr;               /*!< SPIC status register,              Address offset: 0x028 */
    __IO uint32_t imr;              /*!< SPIC interrupt mask register,      Address offset: 0x02C */
    __IO uint32_t isr;          /*!< SPIC interrupt status register,        Address offset: 0x030 */
    __IO uint32_t risr;         /*!< SPIC raw interrupt status register,    Address offset: 0x034 */
    __IO uint32_t txoicr;/*!< SPIC transmit FIFO overflow interrupt clear register,offset: 0x038 */
    __IO uint32_t rxoicr;/*!< SPIC receive FIFO overflow interrupt clear register, offset: 0x03C */
    __IO uint32_t rxuicr;/*!< SPIC receive FIFO underflow interrupt clear register,offset: 0x040 */
    __IO uint32_t msticr;/*!< SPIC master error interrupt clear register,   Address offset: 0x044 */
    __IO uint32_t icr;              /*!< SPIC interrupt clear register, Address offset: 0x048 */
    __IO uint32_t dmacr;            /*!< N/A,                   Address offset: 0x04C */
    __IO uint32_t dmatdlr;          /*!< N/A,                   Address offset: 0x050 */
    __IO uint32_t dmardlr;          /*!< N/A,                   Address offset: 0x054 */
    __IO uint32_t idr;              /*!< SPIC Identiation register,     Address offset: 0x058 */
    __IO uint32_t spi_flash_version;    /*!< SPIC version ID register,      Address offset: 0x05C */
    union
    {
        __IO uint8_t  byte;
        __IO uint16_t half;
        __IO uint32_t word;
    } dr[32];              /*!< SPIC data register,                 Address offset: 0x060~0x0DC */
    __IO uint32_t rd_fast_single;   /*!< Fast read data command of SPI Flash, offset: 0x0E0 */
    __IO uint32_t rd_dual_o;        /*!< Dual output read command of SPI Flash, offset: 0x0E4 */
    __IO uint32_t rd_dual_io;       /*!< Dual I/O read command of SPI Flash, offset: 0x0E8 */
    __IO uint32_t rd_quad_o;        /*!< Quad output read command of SPI Flash, offset: 0x0EC */
    __IO uint32_t rd_quad_io;       /*!< Quad I/O read command of SPI Flash, offset: 0x0F0 */
    __IO uint32_t wr_single;            /*!< Page program command of SPI Flash,  offset: 0x0F4 */
    __IO uint32_t wr_dual_i;    /*!< Dual data input program command of SPI Flash, offset: 0x0F8 */
    __IO uint32_t wr_dual_ii;/*!< Dual address&data program command of SPI Flash,offset: 0x0FC */
    __IO uint32_t wr_quad_i;    /*!< Quad data input program command of SPI Flash,offset: 0x100 */
    __IO uint32_t wr_quad_ii;/*!< Quad address&data program command of SPI Flash,offset: 0x104 */
    __IO uint32_t wr_enable;        /*!< Write enabe command of SPI Flash,  Address offset: 0x108 */
    __IO uint32_t rd_status;            /*!< Read status command of SPI Flash,   offset: 0x10C */
    __IO uint32_t ctrlr2;           /*!< SPIC control register2,            Address offset: 0x110 */
    __IO uint32_t fbaudr;           /*!< SPIC fast baudrate select,         Address offset: 0x114 */
    __IO uint32_t addr_length;      /*!< SPIC address length register,      Address offset: 0x118 */
    __IO uint32_t auto_length;      /*!< SPIC auto address length register, Address offset: 0x11C */
    __IO uint32_t valid_cmd;        /*!< SPIC valid command register,       Address offset: 0x120 */
    __IO uint32_t flash_size;   /*!< SPIC flash size register,           offset: 0x124 */
    __IO uint32_t flush_fifo;           /*!< SPIC flush FIFO register,   offset: 0x128 */
} SPIC_TypeDef;

typedef struct
{
    __IO uint32_t ANA_CR0;          /*!< 0x00 */
    __IO uint32_t ANA_CR1;          /*!< 0x04 */
    __IO uint32_t ANA_CR2;          /*!< 0x08 */
} CODEC_AnalogTypeDef;

typedef struct
{
    __IO uint32_t CR0;              /*!< 0x00 */
    __IO uint32_t ANA_CR1;          /*!< 0x04 */
    __IO uint32_t CLK_CR1;          /*!< 0x08 */
    __IO uint32_t CLK_CR2;          /*!< 0x0C */
    __IO uint32_t CLK_CR3;          /*!< 0x10 */
    __IO uint32_t ASRC_CR0;         /*!< 0x14 */
    __IO uint32_t ASRC_CR1;         /*!< 0x18 */
    __IO uint32_t I2S_CTRL;         /*!< 0x1C */
    __IO uint32_t ADC0_CTRL0;       /*!< 0x20 */
    __IO uint32_t ADC0_CTRL1;       /*!< 0x24 */
    __IO uint32_t ADC1_CTRL0;       /*!< 0x28 */
    __IO uint32_t ADC1_CTRL1;       /*!< 0x2C */
    __IO uint32_t DAC_CTRL0;        /*!< 0x30 */
    __IO uint32_t DAC_CTRL1;        /*!< 0x34 */
} CODEC_TypeDef;

typedef struct
{
    __IO uint32_t EQ_H0;            /*!< 0x40 */
    __IO uint32_t EQ_B1;            /*!< 0x44 */
    __IO uint32_t EQ_B2;            /*!< 0x48 */
    __IO uint32_t EQ_A1;            /*!< 0x4C */
    __IO uint32_t EQ_A2;            /*!< 0x50 */
} CODEC_EQTypeDef;

/**
  * @brief I2S
  */
typedef struct
{
    __O  uint32_t TX_DR;            /*!< 0x00 */
    __IO uint32_t CTRL0;            /*!< 0x04 */
    __IO uint32_t CTRL1;            /*!< 0x08 */
    __IO uint32_t DSP_INT_CR;       /*!< 0x0C */
    __I  uint32_t RX_DR;            /*!< 0x10 */
    __I  uint32_t FIFO_SR;          /*!< 0x14 */
    __IO uint32_t ERROR_CNT_SR;     /*!< 0x18 */
    __IO uint32_t BCLK_DIV;         /*!< 0x1C */
    __IO uint32_t DMA_TRDLR;        /*!< 0x20 */
    __I  uint32_t SR;               /*!< 0x24 */
} I2S_TypeDef;

/**
  * @brief IF8080
  */
typedef struct
{
    __IO uint32_t CTRL0;            /*!< 0x00 */
    __IO uint32_t CTRL1;            /*!< 0x04 */
    __IO uint32_t IMR;              /*!< 0x08 */
    __I  uint32_t SR;               /*!< 0x0C */
    __O  uint32_t ICR;              /*!< 0x10 */
    __IO uint32_t CFG;              /*!< 0x14 */
    __IO uint32_t FIFO;             /*!< 0x18 */
    __I  uint32_t RESV0;            /*!< 0x1C */
    __I  uint32_t RXDATA;           /*!< 0x20 */
    __IO uint32_t TX_LEN;           /*!< 0x24 */
    __I  uint32_t TX_CNT;           /*!< 0x28 */
    __I  uint32_t RESV1;            /*!< 0x2C */
    __IO uint32_t RX_LEN;           /*!< 0x30 */
    __I  uint32_t RX_CNT;           /*!< 0x34 */
    __IO uint32_t CMD1;             /*!< 0x38 */
    __IO uint32_t CMD2;             /*!< 0x3C */
    __IO uint32_t CMD3;             /*!< 0x40 */
} IF8080_TypeDef;

typedef struct
{
    __IO uint32_t SAR;
    __IO uint32_t DAR;
    __IO uint32_t LLP;
    __IO uint32_t CTL_LOW;
    __IO uint32_t CTL_HIGH;
} IF8080_GDMALLITypeDef;

typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t LLI;
} IF8080_GDMATypeDef;


typedef struct
{
    __IO uint32_t SAR_OFT;
    __IO uint32_t DAR_OFT;
} IF8080_GDMALLIOFTTypeDef;


/** @} */ /* End of group RTL876X_Peripheral_Registers_Structures */

