ART-Badge/SDK/bsp_for_art-badge/libraries/inc/platform/rtl876x.h
/*============================================================================*
 *                              Macros
 *============================================================================*/

/** @defgroup RTL876X_Exported_Macros RTL876X  Exported Macros
    * @brief
    * @{
    */

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */
#define SYSTEM_REG_BASE             0x40000000UL
#define PERIPH_REG_BASE             0x40000000UL
#define RTC_REG_BASE                0x40000140UL
#define RTC_LP_REG_BASE             0x40000180UL
#define LPC_REG_BASE                0x40000180UL
#define AON_WDG_REG_BASE            0x40000190UL
#define SYSBLKCTRL_REG_BASE         0x40000200UL
#define PINMUX_REG_BASE             0x40000280UL
#define SPIC_DLY_CTRL_BASE          0x40000300UL
#define PERICLKGAT_REG_BASE         0x40000348UL
#define PWM2_REG_BASE               0x40000364UL
#define PWM3_REG_BASE               0x40000368UL
#define RTC_LED_REG_BASE            0x40000400UL

#define GPIO_REG_BASE               0x40001000UL
#define TIM0_REG_BASE               0x40002000UL
#define TIM1_REG_BASE               0x40002014UL
#define TIM2_REG_BASE               0x40002028UL
#define TIM3_REG_BASE               0x4000203CUL
#define TIM4_REG_BASE               0x40002050UL
#define TIM5_REG_BASE               0x40002064UL
#define TIM6_REG_BASE               0x40002078UL
#define TIM7_REG_BASE               0x4000208CUL
#define QDEC_REG_BASE               0x40004000UL
#define SPI2WIRE_REG_BASE           0x40004000UL
#define KEYSCAN_REG_BASE            0x40005000UL
#define VENDOR_REG_BASE             0x40006000UL
#define WDG_REG_BASE                0x40006000UL
#define PERI_INT_REG_BASE           0x40006004UL
#define RANDOM_GEN_REG_BASE         0x40006150UL
#define CACHE_REG_BASE              0x40007000UL
#define ADC_REG_BASE                0x40010000UL
#define UART1_REG_BASE              0x40011000UL
#define UART0_REG_BASE              0x40012000UL
#define SPI0_REG_BASE               0x40013000UL
#define SPI1_REG_BASE               0x40013400UL
#define HW_AES_REG_BASE             0x40014000UL
#define I2C0_REG_BASE               0x40015000UL
#define I2C1_REG_BASE               0x40015400UL
#define IR_REG_BASE                 0x40016000UL
#define SPORT0_REG_BASE             0x40020000UL
#define I2S0_REG_BASE               0x40020000UL
#define SPORT1_REG_BASE             0x40021000UL
#define I2S1_REG_BASE               0x40021000UL
#define SPDIF_REG_BASE              0x40021800UL
#define CODEC_ANA_REG_BASE          0x40022000UL
#define CODEC_EQ1_REG_BASE          0x40022040UL
#define CODEC_EQ2_REG_BASE          0x40022054UL
#define CODEC_EQ3_REG_BASE          0x40022068UL
#define CODEC_EQ4_REG_BASE          0x4002207CUL
#define CODEC_EQ5_REG_BASE          0x40022090UL
#define CODEC_REG_BASE              0x40022100UL
#define CODEC_CH0_CR_REG_BASE       0x40022200UL
#define CODEC_CH0_EQ1_REG_BASE      0x40022204UL
#define CODEC_CH0_EQ2_REG_BASE      0x40022218UL
#define CODEC_CH0_EQ3_REG_BASE      0x4002222CUL
#define CODEC_CH0_EQ4_REG_BASE      0x40022240UL
#define CODEC_CH0_EQ5_REG_BASE      0x40022254UL
#define CODEC_CH1_CR_REG_BASE       0x40022268UL
#define CODEC_CH1_EQ1_REG_BASE      0x40022280UL
#define CODEC_CH1_EQ2_REG_BASE      0x40022294UL
#define CODEC_CH1_EQ3_REG_BASE      0x400222A8UL
#define CODEC_CH1_EQ4_REG_BASE      0x400222BCUL
#define CODEC_CH1_EQ5_REG_BASE      0x400222D0UL
#define H2D_D2H_REG_BASE            0x40023000UL
#define UART2_REG_BASE              0x40024000UL
#define IF8080_REG_BASE             0x40024800UL
#define IF8080_LLI_REG1_BASE        0x40024850UL
#define IF8080_LLI_REG1_GDMA_BASE   0x400248A0UL
#define IF8080_LLI_REG2_BASE        0x40024880UL
#define IF8080_LLI_REG2_GDMA_BASE   0x400248C0UL
#define IF8080_LLI_REG1_OFT_BASE    0x40024870UL
#define IF8080_LLI_REG2_OFT_BASE    0x40024878UL
#define IF8080_LLI_CR_REG_BASE      0x40024894UL
#define GDMA_CHANNEL_REG_BASE       0x40027000UL // for platform_1_1_1_20160323 later
#define GDMA_Channel0_BASE          (GDMA_CHANNEL_REG_BASE + 0x0000)
#define GDMA_Channel1_BASE          (GDMA_CHANNEL_REG_BASE + 0x0058)
#define GDMA_Channel2_BASE          (GDMA_CHANNEL_REG_BASE + 0x00b0)
#define GDMA_Channel3_BASE          (GDMA_CHANNEL_REG_BASE + 0x0108)
#define GDMA_Channel4_BASE          (GDMA_CHANNEL_REG_BASE + 0x0160)
#define GDMA_Channel5_BASE          (GDMA_CHANNEL_REG_BASE + 0x01b8)
#define GDMA_REG_BASE               (GDMA_CHANNEL_REG_BASE + 0x02c0)
#define RTL_SPI0_BASE               0x40042000UL
#define RTL_SPI1_BASE               0x40042400UL
#define BT_BB_REG_BASE              0x40050000UL
#define HCI_DMA_REG_BASE            0x40064000UL
#define HCI_UART_REG_BASE           0x40068000UL
#define BT_VENDOR_REG_BASE          0x40058000UL
#define SECURITY_REG_BASE           0x40058f28UL
#define GDMA0_REG_BASE              0x40060000UL
#define SPIC0_REG_BASE              0x40080000UL
#define SPIC1_REG_BASE              0x40090000UL
#define SPIC2_REG_BASE              0x400A0000UL

#define SPI0_MASTER_MODE_REG *((volatile uint32_t *)0x40000308UL)
#define SPI0_MASTER_MODE_BIT BIT(8)

/** @brief clock divider for peripheral */
#define SYSTEM_CLK_CTRL  *((volatile uint32_t *)0x4000020CUL)
#define CLK_SOURCE_REG_0 *((volatile uint32_t *)0x40000348UL)
#define CLK_SOURCE_REG_1 *((volatile uint32_t *)0x4000035CUL)
#define CLK_SOURCE_REG_2 *((volatile uint32_t *)0x40000360UL)

#define PERI_CLOCKGATE_REG_BASE     0x40000348UL

#define REG_PEON_SYS_CLK_SEL        0x0200
#define REG_PEON_SYS_CLK_SEL_2      0x0208
#define REG_PEON_SYS_CLK_SEL_3      0x020C
#define REG_SOC_FUNC_EN             0x0210
#define REG_SOC_HCI_COM_FUNC_EN     0x0214
#define REG_SOC_PERI_FUNC0_EN       0x0218
#define REG_SOC_PERI_FUNC1_EN       0x021C
#define REG_PESOC_CLK_CTRL          0x0230
#define REG_PESOC_PERI_CLK_CTRL0    0x0234
#define REG_PESOC_PERI_CLK_CTRL1    0x0238
#define REG_PESOC_DSP_SHARE_RAM     0x0250
#define REG_TEST_MODE               0x02a8
#define REG_ANAPAR_PLL1_0           0x0320
#define REG_ANAPAR_PLL3_2           0x0324
#define REG_ANAPAR_PLL5_4           0x0328
#define REG_XTAL_PLL_READY          0x0338

