ART-Badge/SDK/bsp_for_art-badge/libraries/inc/platform/rtl876x.h
#define GPIO_OUTPUT_OFFSET          0x00
#define GPIO_DIRECTION_OFFSET       0x04

/** @brief AON PAD AREA */
#define REG_PAD_WKEN_ADDRESS        0x20
#define REG_PAD_WK_CTRL_ADDRESS     0x12d
#define REG_PAD_WKPOL_ADDRESS       0x25
#define REG_PAD_O_ADDRESS           0x2A
#define REG_AON_PAD_E_ADDRESS       0x2F
#define REG_AON_PAD_S_ADDRESS       0x34
#define REG_AON_PAD_PU_ADDRESS      0x39
#define REG_AON_PAD_PD_ADDRESS      0x3E
#define REG_AON_PAD_PWRON_ADDRESS   0x4C

#define BIT_WK_INTEN                (1U << 7) /**< BIT7 */
#define BIT_WK_FLAG_GPIO            (1U << 6) /**< BIT6 */

#define BIT_SOC_ACTCK_GPIO_EN       (1U << 24) /**< BIT24 */
#define BIT_PERI_GPIO_EN            (1U << 8) /**< BIT8 */

#define BIT_PERI_KEYSCAN_EN         (1U << 19) /**< BIT19 */
#define BIT_SOC_ACTCK_KEYSCAN_EN    (1U << 6) /**< BIT6 */


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */
/** @brief System */
#define PERIPH                          ((PHERIPHERIAL_TypeDef  *) PERIPH_REG_BASE)
#define SYSBLKCTRL                      ((SYS_BLKCTRL_TypeDef   *) SYSBLKCTRL_REG_BASE)
#define PERIPHINT                       ((PERI_INT_TypeDef      *) VENDOR_REG_BASE)
#define SECURITY                        ((SECURITY_TypeDef      *) SECURITY_REG_BASE)

/** @brief IO */
#define PINMUX                          ((PINMUX_TypeDef        *) PINMUX_REG_BASE)
#define KEYSCAN                         ((KEYSCAN_TypeDef       *) KEYSCAN_REG_BASE)
#define GPIO                            ((GPIO_TypeDef          *) GPIO_REG_BASE)
#define QDEC                            ((QDEC_TypeDef          *) QDEC_REG_BASE)
#define I2C0                            ((I2C_TypeDef           *) I2C0_REG_BASE)
#define I2C1                            ((I2C_TypeDef           *) I2C1_REG_BASE)
#define SPI0                            ((SPI_TypeDef           *) SPI0_REG_BASE)
#define SPI1                            ((SPI_TypeDef           *) SPI1_REG_BASE)
#define TIM0                            ((TIM_TypeDef           *) TIM0_REG_BASE)
#define TIM1                            ((TIM_TypeDef           *) TIM1_REG_BASE)
#define TIM2                            ((TIM_TypeDef           *) TIM2_REG_BASE)
#define TIM3                            ((TIM_TypeDef           *) TIM3_REG_BASE)
#define TIM4                            ((TIM_TypeDef           *) TIM4_REG_BASE)
#define TIM5                            ((TIM_TypeDef           *) TIM5_REG_BASE)
#define TIM6                            ((TIM_TypeDef           *) TIM6_REG_BASE)
#define TIM7                            ((TIM_TypeDef           *) TIM7_REG_BASE)
#define PWM2                            ((PWM_TypeDef           *) PWM2_REG_BASE)
#define PWM3                            ((PWM_TypeDef           *) PWM3_REG_BASE)
#define GDMA_BASE                       ((GDMA_TypeDef *) GDMA_REG_BASE)
#define GDMA_Channel0                   ((GDMA_ChannelTypeDef *) GDMA_Channel0_BASE)
#define GDMA_Channel1                   ((GDMA_ChannelTypeDef *) GDMA_Channel1_BASE)
#define GDMA_Channel2                   ((GDMA_ChannelTypeDef *) GDMA_Channel2_BASE)
#define GDMA_Channel3                   ((GDMA_ChannelTypeDef *) GDMA_Channel3_BASE)
#define GDMA_Channel4                   ((GDMA_ChannelTypeDef *) GDMA_Channel4_BASE)
#define GDMA_Channel5                   ((GDMA_ChannelTypeDef *) GDMA_Channel5_BASE)
#define ADC                             ((ADC_TypeDef             *) ADC_REG_BASE)
#define UART0                           ((UART_TypeDef            *) UART0_REG_BASE)
#define UART1                           ((UART_TypeDef            *) UART1_REG_BASE)
#define UART2                           ((UART_TypeDef            *) UART2_REG_BASE)
#define SPI3WIRE                        ((SPI3WIRE_TypeDef        *) SPI2WIRE_REG_BASE)
#define IR                              ((IR_TypeDef              *) IR_REG_BASE)
#define RTC                             ((RTC_TypeDef             *) RTC_REG_BASE)
#define RTC_LP                          ((RTC_LP_TypeDef             *) RTC_LP_REG_BASE)
#define RTC_LED                         ((RTC_LED_TypeDef         *) RTC_LED_REG_BASE)
#define LPC                             ((LPC_TypeDef             *) LPC_REG_BASE)
#define HWAES                           ((HW_AES_TypeDef          *) HW_AES_REG_BASE)
#define WDG                             ((WDG_TypeDef             *) WDG_REG_BASE)
#define AON_WDG                         ((AON_WDG_TypeDef         *) AON_WDG_REG_BASE)
#define RAN_GEN                         ((RAN_GEN_TypeDef         *) RANDOM_GEN_REG_BASE)
#define ICG                             ((ICG_TypeDef             *) ICG_REG_BASE)
#define CACHE                           ((CACHE_TypeDef           *) CACHE_REG_BASE)
#define SPIC                            ((SPIC_TypeDef            *) SPIC0_REG_BASE)
#define SPIC0                           ((SPIC_TypeDef            *) SPIC0_REG_BASE)
#define SPIC1                           ((SPIC_TypeDef            *) SPIC1_REG_BASE)
#define SPIC2                           ((SPIC_TypeDef            *) SPIC2_REG_BASE)
#define CODEC_ANA                       ((CODEC_AnalogTypeDef*)CODEC_ANA_REG_BASE)
#define CODEC                           ((CODEC_TypeDef*) CODEC_REG_BASE)
#define CODEC_CH0_CR                    (*((volatile uint32_t *)CODEC_CH0_CR_REG_BASE))
#define CODEC_CH0_EQ1                   ((CODEC_EQTypeDef*) CODEC_CH0_EQ1_REG_BASE)
#define CODEC_CH0_EQ2                   ((CODEC_EQTypeDef*) CODEC_CH0_EQ2_REG_BASE)
#define CODEC_CH0_EQ3                   ((CODEC_EQTypeDef*) CODEC_CH0_EQ3_REG_BASE)
#define CODEC_CH0_EQ4                   ((CODEC_EQTypeDef*) CODEC_CH0_EQ4_REG_BASE)
#define CODEC_CH0_EQ5                   ((CODEC_EQTypeDef*) CODEC_CH0_EQ5_REG_BASE)
#define CODEC_CH1_CR                    (*((volatile uint32_t *)CODEC_CH1_CR_REG_BASE))
#define CODEC_CH1_EQ1                   ((CODEC_EQTypeDef*) CODEC_CH1_EQ1_REG_BASE)
#define CODEC_CH1_EQ2                   ((CODEC_EQTypeDef*) CODEC_CH1_EQ2_REG_BASE)
#define CODEC_CH1_EQ3                   ((CODEC_EQTypeDef*) CODEC_CH1_EQ3_REG_BASE)
#define CODEC_CH1_EQ4                   ((CODEC_EQTypeDef*) CODEC_CH1_EQ4_REG_BASE)
#define CODEC_CH1_EQ5                   ((CODEC_EQTypeDef*) CODEC_CH1_EQ5_REG_BASE)
#define I2S0                            ((I2S_TypeDef*) I2S0_REG_BASE)
#define I2S1                            ((I2S_TypeDef*) I2S1_REG_BASE)
#define IF8080                          ((IF8080_TypeDef*) IF8080_REG_BASE)
#define IF8080_LLPGROUP1                ((IF8080_GDMALLITypeDef*) IF8080_LLI_REG1_BASE)
#define IF8080_LLPGROUP2                ((IF8080_GDMALLITypeDef*) IF8080_LLI_REG2_BASE)
#define IF8080_LLPGROUP1_GDMA           ((IF8080_GDMALLITypeDef*) IF8080_LLI_REG1_GDMA_BASE)
#define IF8080_LLPGROUP2_GDMA           ((IF8080_GDMALLITypeDef*) IF8080_LLI_REG2_GDMA_BASE)

#define IF8080_LLPGROUP1_OFT            ((IF8080_GDMALLIOFTTypeDef*) IF8080_LLI_REG1_OFT_BASE)
#define IF8080_LLPGROUP2_OFT            ((IF8080_GDMALLIOFTTypeDef*) IF8080_LLI_REG2_OFT_BASE)
#define IF8080_GDMA                     ((IF8080_GDMATypeDef*)IF8080_LLI_CR_REG_BASE)

#define CLK_GATE                        ((Peri_ClockGate_TypeDef  *) PERI_CLOCKGATE_REG_BASE)



//Add by Vendor
#define LITTLE_ENDIAN                         0
#define BIG_ENDIAN                              1
#define SYSTEM_ENDIAN                        LITTLE_ENDIAN

